#### Data Manipulation and Analysis with Pandas

In [6]:
import pandas as pd

df=pd.read_csv('data.csv')
print(df.head(5))

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [7]:
print(df.tail(5))

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [8]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [9]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [11]:
df.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [12]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [14]:
df_filled = df.fillna(0)

df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [15]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [17]:
df['Sales_fillNa']=df['Sales'].fillna(df['Sales'].mean())
df.head()

         Date Category  Value   Product  Sales Region  Sales_fillNa
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [18]:
df['vijay']=df['Sales'].fillna(df['Sales'].mean())
df.head()

         Date Category  Value   Product  Sales Region  Sales_fillNa  vijay
0  2023-01-01        A   28.0  Product1  754.0   East         754.0  754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0  110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0  398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0  522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0  869.0

In [19]:
df.dtypes

Date             object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_fillNa    float64
vijay           float64
dtype: object

In [32]:
df=df.rename(columns={'Date':'Sales Date'})
df.head()

   Sales Date Category  Value   Product  Sales Region  Sales_fillNa  vijay
0  2023-01-01        A   28.0  Product1  754.0   East         754.0  754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0  110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0  398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0  522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0  869.0

In [37]:
df.dtypes

Sales Date       object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_fillNa    float64
vijay           float64
dtype: object

In [38]:
df['Value_new']=df['Value'].fillna(df['Value'].mean()).astype(int)
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNa,vijay,Value_new
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,754.0,28
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,110.0,39
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,398.0,32
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,522.0,8
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,869.0,26

In [39]:
df['New Value'] = df['Value'].apply(lambda x:x*2)
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNa,vijay,Value_new,New Value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,110.0,39,78.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,398.0,32,64.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,522.0,8,16.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,869.0,26,52.0

In [40]:
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNa,vijay,Value_new,New Value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,110.0,39,78.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,398.0,32,64.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,522.0,8,16.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,869.0,26,52.0

In [42]:
grouped_mean=df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [43]:
group_sum = df.groupby(['Product','Region'])['Value'].sum()
print(group_sum)

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [44]:
df.groupby(['Product','Region'])['Value'].mean()

Product   Region
Product1  East      41.714286
          North      4.500000
          South     50.000000
          West      82.000000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     40.600000
          South     71.666667
          West      62.166667
Name: Value, dtype: float64

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sales Date    50 non-null     object
 1   Category      50 non-null     object
 2   Value         47 non-null     float64
 3   Product       50 non-null     object
 4   Sales         46 non-null     float64
 5   Region        50 non-null     object
 6   Sales_fillNa  50 non-null     float64
 7   vijay         50 non-null     float64
 8   Value_new     50 non-null     int64
 9   New Value     47 non-null     float64
dtypes: float64(5), int64(1), object(4)
memory usage: 4.0+ KB

In [46]:
#Merging and joining data frames

df1 = pd.DataFrame({'Key': ['A','B','C'],'Value1': [1,2,3]})
df2 = pd.DataFrame({'Key': ['A','B','D'],'Value2': [4,5,6]})

df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [47]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [50]:
pd.merge(df1,df2,on='Key',how='inner')

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [53]:
print(df1)
print(df2)

  Key  Value1
0   A       1
1   B       2
2   C       3
  Key  Value2
0   A       4
1   B       5
2   D       6

In [51]:
pd.merge(df1,df2,on="Key",how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0